README.org
#+TITLE:   My Personal Doom Emacs conf.
#+DATE:    julio 24, 2021
#+STARTUP: inlineimages nofold

* Table of Contents :TOC_3:noexport:
- [[#description][Description]]
  - [[#maintainers][Maintainers]]
  - [[#module-flags][Module Flags]]
  - [[#plugins][Plugins]]
- [[#prerequisites][Prerequisites]]
- [[#features][Features]]
- [[#configuration][Configuration]]
- [[#troubleshooting][Troubleshooting]]

* Description
# A summary of what this module does.

+ This is my configuration that I use to work with doom emacs, it uses several languages.
+ Also a configuration for the use of wakatime and an integration with Discord.

** Maintainers
+ @tysyak Cristian Romero

# If this module has no maintainers, then...
This module has no dedicated maintainers.

** Module Flags
+ =+flag1= A short description of what this flag does and what it might need
  when enabled.
+ =+flag2= A short description of what this flag does and what it might need
  when enabled.
+ =+flag3= A short description of what this flag does and what it might need
  when enabled.

# If this module has no flags, then...
This module provides no flags.

** Plugins
# # A list of linked plugins
# + [[https://orgmode.org/][org-plus-contrib]]
# + [[https://github.com/sabof/org-bullets][org-bullets]]
# + [[https://github.com/TobiasZawada/org-yt][org-yt]]
# + [[https://github.com/sebastiencs/company-box][company-box]]* (=+childframe=)
# + =:lang crystal=
#   + [[https://github.com/brantou/ob-crystal][ob-crystal]]
# + =:lang go=
#   + [[https://github.com/pope/ob-go][ob-go]]
# + =+present=
#   + [[https://github.com/anler/centered-window-mode][centered-window]]
#   + [[https://github.com/takaxp/org-tree-slide][org-tree-slide]]
#   + [[https://gitlab.com/oer/org-re-reveal][org-re-reveal]]

# ** [#B] Hacks
# A list of internal modifications to included packages; omit if unneeded

* Prerequisites
A submodule of the same author is used for integration with discord, well you can comment the line to omit this integraton.

* Features
# An in-depth list of features, how to use them, and their dependencies.

* Configuration
# How to configure this module, including common problems and how to address them.

* Troubleshooting
# Common issues and their solution, or places to look for help.
