README.md

# Table of Contents

1.  [Description](#org36125a8)
    1.  [Maintainers](#org10491c3)
    2.  [Module Flags](#org539efc6)
    3.  [Plugins](#org781f99b)
2.  [Prerequisites](#org86dce0e)
3.  [Features](#orge0e8fda)
4.  [Configuration](#org39c9380)
5.  [Troubleshooting](#org04a245c)



<a id="org36125a8"></a>

# Description

-   This is my configuration that I use to work with doom emacs, it uses several languages.
-   Also a configuration for the use of wakatime and an integration with Discord.


<a id="org10491c3"></a>

## Maintainers

-   @tysyak Cristian Romero

This module has no dedicated maintainers.


<a id="org539efc6"></a>

## Module Flags

-   `+flag1` A short description of what this flag does and what it might need
    when enabled.
-   `+flag2` A short description of what this flag does and what it might need
    when enabled.
-   `+flag3` A short description of what this flag does and what it might need
    when enabled.

This module provides no flags.


<a id="org781f99b"></a>

## Plugins


<a id="org86dce0e"></a>

# Prerequisites

A submodule of the same author is used for integration with discord, well you can comment the line to omit this integraton.


<a id="orge0e8fda"></a>

# Features


<a id="org39c9380"></a>

# Configuration


<a id="org04a245c"></a>

# Troubleshooting

